app/views/pages/home.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 10]]
SELECT "posts".* FROM "posts" WHERE (user_id = 1)  ORDER BY "posts"."created_at" DESC
---
            <div class="col-sm-11">
             <p class="post-titles"><a class="posted-user" href=""><%= User.find(@p.user_id).username %></a> - <%= @p.created_at.to_formatted_s(:short) %></p>