app/controllers/pages_controller.rb

SELECT "posts".* FROM "posts" WHERE (user_id = 1)  ORDER BY "posts"."created_at" DESC
---
  def home
     @posts = Post.all

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "lilly"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 6]]
SELECT "posts".* FROM "posts" WHERE (user_id = 6)  ORDER BY "posts"."created_at" DESC
---
  def profile
    #get username
  if (User.find_by_username(params[:id]))
    @username = params[:id]
  else
    redirect_to root_path, :notice => "User not found!"
  end
     @posts = Post.all.where("user_id = ?", User.find_by_username(params[:id]).id)